[
  {
    "puesto": "Full stack",
    "empresa": "Alura latam",
    "fecha_ini": "06/2023",
    "fecha_fin": "Presente",
    "ciudad": "Zapoapan Ixtaczoquitlan",
    "pais": "México",
    "logros": [
      {
        "logro": "Desarrollo de un sistema de encriptado y desencriptado de textos que es seguro y eficiente."
      },
      {
        "logro": "Creación de una interfaz de usuario intuitiva y fácil de usar."
      }
    ]
  },

  {
    "puesto": "Project Manager",
    "empresa": "Axolotl developer",
    "fecha_ini": "03/2023",
    "fecha_fin": "07/2023",
    "ciudad": "Sumidero Ixtaczoquitlan",
    "pais": "México",
    "logros": [
      {
        "logro": "Desarrollo un motor de inferencia basado en prolog para el juego, que era capaz de adivinar el personaje que estaba pensando el jugador con una precisión del 95%."
      },
      {
        "logro": "Implementación un sistema de captura de movimiento basado en Kinect para el juego, que permitía a los usuarios interactuar con el juego de forma natural."
      },
      {
        "logro": "Desarrolló una base de datos de personajes para el juego, que contenía información sobre los personajes."
      }
    ]
  },

  {
    "puesto": "Frontend developer",
    "empresa": "Axolotl developer",
    "fecha_ini": "02/2023",
    "fecha_fin": "07/2023",
    "ciudad": "Sumidero Ixtaczoquitlan",
    "pais": "México",
    "logros": [
      {
        "logro": "Desarrollo de la página de registro de usuarios utilizando Angular. La nueva página de registro es más fácil de usar e intuitiva."
      },
      {
        "logro": "Actualización de la página principal del sitio web utilizando Angular, agregando nuevas funciones y contenido. La nueva página principal es más atractiva y informativa, y ha mejorado la experiencia del usuario."
      },
      {
        "logro": "Creación de la página de comentarios utilizando Angular, permitiendo a los usuarios dar su opinión sobre el sitio web. La nueva página de comentarios ha proporcionado información valiosa sobre la satisfacción de los usuarios."
      }
    ]
  },
  {
    "puesto": "Backend developer",
    "empresa": "Axolotl developer",
    "fecha_ini": "9/2022",
    "fecha_fin": "10/2022",
    "ciudad": "Sumidero Ixtaczoquitlan",
    "pais": "México",
    "logros": [
      {
        "logro": "Desarrollo de un algoritmo para estimar el esfuerzo y el coste de desarrollo de software, basado en el modelo cocomo."
      },
      {
        "logro": "Implementación de un algoritmo en una aplicación de escritorio, que era fácil de usar y escalable."
      },
      {
        "logro": "Aplicación probada con éxito en un conjunto de datos de proyectos de desarrollo de software."
      }
    ]
  },

  {
    "puesto": "Backend developer",
    "empresa": "CRAU",
    "fecha_ini": "7/2022",
    "fecha_fin": "Presente",
    "ciudad": "Fortin de las Flores",
    "pais": "México",
    "logros": [
      {
        "logro": "Corrección de la base de datos, eliminando errores que estaban causando problemas de rendimiento."
      },
      {
        "logro": "Corrección de la base de datos, eliminando errores que estaban causando problemas de rendimiento."
      }
    ]
  }
]
